# EcclesiaFlow — Messages email (Fran\u00e7ais)
# Placeholders Keycloak : {0}=lien, {1}=expiration, {2}=nom du realm
# Les templates FTL utilisent msg("key") pour ces valeurs

# --- Partag\u00e9 ---
allRightsReserved=Tous droits r\u00e9serv\u00e9s.
emailAutoMessage=Ceci est un message automatique. Merci de ne pas r\u00e9pondre.
emailLinkFallback=Si le bouton ne fonctionne pas, copiez-collez ce lien dans votre navigateur :
emailTitle=EcclesiaFlow
eventDate=Date
eventIpAddress=Adresse IP

# --- V\u00e9rification d''email (lien) ---
emailVerificationSubject=V\u00e9rifiez votre compte EcclesiaFlow
emailVerificationTitle=V\u00e9rifiez votre e-mail
emailVerificationGreeting=Bienvenue sur EcclesiaFlow ! Confirmez votre adresse e-mail pour activer votre compte.
emailVerificationInstruction=Cliquez sur le bouton ci-dessous pour v\u00e9rifier votre adresse e-mail. Ce lien expirera dans
emailVerificationBtn=V\u00e9rifier mon e-mail
emailVerificationHint=Si vous n''avez pas cr\u00e9\u00e9 de compte EcclesiaFlow, vous pouvez ignorer cet e-mail.
emailVerificationBody=Bienvenue sur EcclesiaFlow !\n\nCliquez sur le lien ci-dessous pour v\u00e9rifier votre adresse e-mail :\n\n{0}\n\nCe lien expirera dans {1}.\n\nSi vous n''avez pas cr\u00e9\u00e9 de compte, ignorez cet email.
emailVerificationBodyHtml=<p>Bienvenue sur <strong>EcclesiaFlow</strong> !</p><p>Cliquez sur le lien ci-dessous pour v\u00e9rifier votre adresse e-mail :</p><p><a href="{0}" style="display:inline-block;padding:14px 36px;background:linear-gradient(135deg,#3B52F6,#5469F7);color:#ffffff;text-decoration:none;border-radius:12px;font-weight:600;">V\u00e9rifier mon e-mail</a></p><p style="color:#94a3b8;font-size:13px;">Ce lien expirera dans {1}.</p>

# --- V\u00e9rification d''email (code) ---
emailVerificationCodeTitle=Votre code de v\u00e9rification
emailVerificationCodeSubtitle=Saisissez le code ci-dessous dans EcclesiaFlow pour v\u00e9rifier votre adresse e-mail.
emailVerificationCodeLabel=Votre code :
emailVerificationCodeExpiry=Ce code expirera dans
emailVerificationCodeHint=Si vous n''avez pas demand\u00e9 ce code, ignorez cet e-mail. Quelqu''un a peut-\u00eatre saisi votre adresse par erreur.

# --- R\u00e9initialisation de mot de passe ---
passwordResetSubject=R\u00e9initialisez votre mot de passe EcclesiaFlow
passwordResetTitle=R\u00e9initialisez votre mot de passe
passwordResetSubtitle=Nous avons re\u00e7u une demande de r\u00e9initialisation du mot de passe de votre compte EcclesiaFlow.
passwordResetInstruction=Cliquez sur le bouton ci-dessous pour d\u00e9finir un nouveau mot de passe. Ce lien expirera dans
passwordResetBtn=R\u00e9initialiser mon mot de passe
passwordResetHint=Si vous n''avez pas demand\u00e9 de r\u00e9initialisation, ignorez cet e-mail. Votre mot de passe restera inchang\u00e9.
passwordResetBody=Nous avons re\u00e7u une demande de r\u00e9initialisation de votre mot de passe EcclesiaFlow.\n\nCliquez sur le lien ci-dessous pour en d\u00e9finir un nouveau :\n\n{0}\n\nCe lien expirera dans {1}.\n\nSi vous n''avez pas demand\u00e9 cette r\u00e9initialisation, ignorez cet email.
passwordResetBodyHtml=<p>Nous avons re\u00e7u une demande de r\u00e9initialisation de votre mot de passe <strong>EcclesiaFlow</strong>.</p><p><a href="{0}" style="display:inline-block;padding:14px 36px;background:linear-gradient(135deg,#d97706,#F59E0B);color:#ffffff;text-decoration:none;border-radius:12px;font-weight:600;">R\u00e9initialiser mon mot de passe</a></p><p style="color:#94a3b8;font-size:13px;">Ce lien expirera dans {1}.</p>

# --- Actions requises (initi\u00e9es par l''admin) ---
executeActionsSubject=Action requise sur votre compte EcclesiaFlow
executeActionsTitle=Action requise
executeActionsSubtitle=Votre administrateur EcclesiaFlow vous demande d''effectuer les actions suivantes :
executeActionsListTitle=Actions requises :
executeActionsInstruction=Cliquez sur le bouton ci-dessous pour continuer. Ce lien expirera dans
executeActionsBtn=Effectuer les actions
executeActionsHint=Si vous n''attendiez pas cet e-mail, contactez l''administrateur de votre \u00e9glise.
executeActionsBody=Votre administrateur vous demande d''effectuer les actions suivantes :\n\n{0}\n\nCliquez sur le lien ci-dessous pour continuer :\n\n{1}\n\nCe lien expirera dans {2}.
executeActionsBodyHtml=<p>Votre administrateur vous demande d''effectuer les actions suivantes :</p><p>{0}</p><p><a href="{1}" style="display:inline-block;padding:14px 36px;background:linear-gradient(135deg,#3B52F6,#5469F7);color:#ffffff;text-decoration:none;border-radius:12px;font-weight:600;">Effectuer les actions</a></p><p style="color:#94a3b8;font-size:13px;">Ce lien expirera dans {2}.</p>

# --- Alerte de s\u00e9curit\u00e9 (tentative de connexion \u00e9chou\u00e9e) ---
eventLoginErrorSubject=Alerte de s\u00e9curit\u00e9 \u2014 Tentative de connexion \u00e9chou\u00e9e
eventLoginErrorTitle=Tentative de connexion \u00e9chou\u00e9e
eventLoginErrorSubtitle=Nous avons d\u00e9tect\u00e9 une tentative de connexion infructueuse sur votre compte EcclesiaFlow.
eventLoginErrorBody=Si c''\u00e9tait vous, aucune action n''est requise. Si vous ne reconnaissez pas cette activit\u00e9, nous vous recommandons fortement de changer votre mot de passe imm\u00e9diatement.
eventLoginErrorBtn=S\u00e9curiser mon compte
eventLoginErrorHint=Cette notification a \u00e9t\u00e9 envoy\u00e9e car la protection contre les attaques par force brute est activ\u00e9e sur votre compte.
eventLoginErrorBodyHtml=<p>Nous avons d\u00e9tect\u00e9 une tentative de connexion infructueuse sur votre compte EcclesiaFlow.</p><p>Date : {0}<br/>IP : {1}</p><p style="color:#94a3b8;font-size:13px;">Si c''\u00e9tait vous, aucune action n''est requise.</p>

# --- Mot de passe modifi\u00e9 ---
eventUpdatePasswordSubject=Votre mot de passe EcclesiaFlow a \u00e9t\u00e9 modifi\u00e9
eventUpdatePasswordTitle=Mot de passe modifi\u00e9
eventUpdatePasswordSubtitle=Votre mot de passe EcclesiaFlow a \u00e9t\u00e9 modifi\u00e9 avec succ\u00e8s.
eventUpdatePasswordBadge=Mot de passe modifi\u00e9 avec succ\u00e8s
eventUpdatePasswordOk=Si vous \u00eates \u00e0 l''origine de ce changement, aucune action suppl\u00e9mentaire n''est requise.
eventUpdatePasswordWarning=Si vous n''\u00eates <strong>pas</strong> \u00e0 l''origine de ce changement, votre compte a peut-\u00eatre \u00e9t\u00e9 compromis. Veuillez r\u00e9initialiser votre mot de passe imm\u00e9diatement et contacter l''administrateur de votre \u00e9glise.
eventUpdatePasswordHint=Ceci est une notification de s\u00e9curit\u00e9. Vous recevrez cet e-mail \u00e0 chaque modification de votre mot de passe.
eventUpdatePasswordBody=Votre mot de passe EcclesiaFlow a \u00e9t\u00e9 modifi\u00e9 avec succ\u00e8s.\n\nSi vous \u00eates \u00e0 l''origine de ce changement, aucune action n''est requise.\n\nSi vous n''\u00eates PAS \u00e0 l''origine de ce changement, votre compte a peut-\u00eatre \u00e9t\u00e9 compromis.
eventUpdatePasswordBodyHtml=<p>Votre mot de passe EcclesiaFlow a \u00e9t\u00e9 modifi\u00e9 avec succ\u00e8s.</p><p>Si vous \u00eates \u00e0 l''origine de ce changement, aucune action n''est requise.</p><p>Si vous n''\u00eates <strong>pas</strong> \u00e0 l''origine de ce changement, votre compte a peut-\u00eatre \u00e9t\u00e9 compromis.</p>
